Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: JBang currently does not support multiple source files.
ja_jp: 現在、 jbang は複数のソースファイルをサポートしていません。

source: JBang will use your existing Java or install one for you if needed.
ja_jp: JBang は、既存の Java を使用するか、必要に応じて Java をインストールします。

source: JBoss Logging is built into Quarkus and provides link:https://quarkus.io/developer-joy/[unified configuration] for all xref:logging-apis[supported logging APIs].
ja_jp: JBossロギングはQuarkusに組み込まれており、 xref:logging-apis[サポートされているすべてのロギングAPI] に対して link:https://quarkus.io/developer-joy/[統一された設定] を提供します。

source: JBoss Logging loading a non-existing class
ja_jp: 存在しないクラスをロードする JBoss Logging

source: JBoss Logging, integrated into Quarkus, offers a unified configuration for all <<logging-apis,supported logging APIs>> through a single configuration file that sets up all available extensions. To adjust runtime logging, modify the `application.properties` file.
ja_jp: Quarkusに統合されたJBoss Loggingでは、使用可能なすべてのエクステンションを設定する単一の設定ファイルを通じて、 xref:logging-apis[サポートされている] すべての xref:logging-apis[ロギングAPIの] 統一された設定が提供されます。実行時のロギングを調整するには、 `application.properties` ファイルを変更します。

source: JBoss Logging, integrated into {project-name}, offers a unified configuration for all <<logging-apis,supported logging APIs>> through a single configuration file that sets up all available extensions. To adjust runtime logging, modify the `application.properties` file.
ja_jp: {project-name} に統合された JBoss Logging は、利用可能なすべてのエクステンションを設定する単一の設定ファイルを通じて、サポートされているすべての <<logging-apis,supported logging APIs>> 設定を一元化します。 ランタイムロギングを調整するには、 `application.properties` を変更します。

source: JBoss Logging, integrated into {project-name}, provides a unified configuration for all <<logging-apis,supported logging APIs>> through a single configuration file that sets up all available extensions.
ja_jp: {project-name} に統合された JBoss Logging は、利用可能なすべてのエクステンションを設定する単一の設定ファイルを通じて、すべての <<logging-apis,サポートされているロギング API>> に対して統一された設定を提供します。

source: JDBC Configuration Reference
ja_jp: JDBC 設定リファレンス

source: JDBC Datasource
ja_jp: JDBCデータソース

source: JDBC Driver - Derby
ja_jp: JDBC ドライバー - Derby

source: JDBC Driver - H2
ja_jp: JDBC ドライバー - H2

source: JDBC Driver - MariaDB
ja_jp: JDBC ドライバー - MariaDB

source: JDBC Driver - Microsoft SQL Server
ja_jp: JDBC ドライバー - Microsoft SQL Server

source: JDBC Driver - MySQL
ja_jp: JDBC ドライバー - MySQL

source: JDBC Driver - PostgreSQL
ja_jp: JDBC ドライバー - PostgreSQL

source: JDBC URL Reference
ja_jp: JDBC URL リファレンス

source: JDBC URL reference
ja_jp: JDBC URL リファレンス

source: JDBC and reactive datasources simultaneously
ja_jp: JDBC とリアクティブデータソースの同時利用

source: JDBC configuration reference
ja_jp: JDBC 設定リファレンス

source: JDBC connection pool size adjustment
ja_jp: JDBC接続プールのサイズ調整

source: JDBC datasource
ja_jp: JDBC データソース

source: JDBC datasources and ActiveMQ Artemis allow the enlistment and automatically register the `XAResourceRecovery`.
ja_jp: JDBCデータソースとActiveMQ Artemisは、 `XAResourceRecovery` を自動的に登録します。

source: JDBC datasources is part of `quarkus-agroal`, and it needs to use `quarkus.datasource.jdbc.transactions=XA`.
ja_jp: JDBC データソースは `quarkus-agroal` の一部であり、 `quarkus.datasource.jdbc.transactions=XA` を使用する必要があります。

source: JDBC driver
ja_jp: JDBC ドライバー

source: JDBC is the most common database connection pattern, typically needed when used in combination with non-reactive Hibernate ORM.
ja_jp: JDBC は最も一般的なデータベース接続パターンで、典型的には非リアクティブ型の Hibernate ORM と組み合わせて使用する場合に必要となります。

source: JDBC is the most common database connection pattern. You typically need a JDBC datasource when using Hibernate ORM.
ja_jp: JDBC は最も一般的なデータベース接続パターンです。通常、Hibernate ORM を使用する場合は JDBC データソースが必要です。

source: JDK 11 as minimal version
ja_jp: JDK 11が最小バージョン

source: JDK 11 installed with `JAVA_HOME` configured appropriately
ja_jp: JDK 11 がインストールされ、 `JAVA_HOME` が適切に設定されていること

source: JDK 11 is the minimal version to use Quarkus 2.0.
ja_jp: JDK 11が、Quarkus 2.0を使用するための最小バージョンになりました。

source: JDK 11+ installed with `JAVA_HOME` configured appropriately
ja_jp: JDK 11+ がインストールされ、 `JAVA_HOME` が適切に設定されていること

source: JDK 17 installed with `JAVA_HOME` configured appropriately
ja_jp: JDK 17+がインストールされ、 `JAVA_HOME` が適切に設定されている

source: JDK 17+ installed with `JAVA_HOME` configured appropriately
ja_jp: JDK 17+がインストールされ、 `JAVA_HOME` が適切に設定されていること

source: JDK 8 is not supported anymore (but you can keep using 1.13.x if you are stuck with it!).
ja_jp: JDK 8はもうサポートされていません（ただし、1.13.xにこだわっている方は使い続けることができます！）。

source: JDK `java.util.logging` (also called JUL)
ja_jp: JDK `java.util.logging` (JUL とも呼ばれます)

source: JDK classes
ja_jp: JDK クラス

source: JDK distributions typically contain a truststore in the `$JAVA_HOME/lib/security/cacerts` file. SunJSSE uses this truststore as the default truststore. SunJSSE is the default implementation of the Java Secure Socket Extension (JSSE).
ja_jp: JDK ディストリビューションには通常、`$JAVA_HOME/lib/security/cacerts` ファイルにトラストストアが含まれています。SunJSSE は、このトラストストアをデフォルトのトラストストアとして使用します。SunJSSE は、Java Secure Socket Extension (JSSE) のデフォルト実装です。

source: JDK distributions typically contain a truststore in the `$JAVA_HOME/lib/security/cacerts` file. This truststore is used as a default truststore by SunJSSE, the default implementation of the Java Secure Socket Extension (JSSE). SSL/TLS capabilities provided by SunJSSE are leveraged by various Java Runtime components, such as `javax.net.ssl.HttpsURLConnection` and others.
ja_jp: JDK ディストリビューションには通常、`$JAVA_HOME/lib/security/cacerts` ファイルにトラストストアが含まれています。 このトラストストアは、Java Secure Socket Extension (JSSE) のデフォルト実装である SunJSSE によってデフォルトのトラストストアとして使用されます。 SunJSSE によって提供される SSL/TLS 機能は、`javax.net.ssl.HttpsURLConnection` などのさまざまな Java Runtime コンポーネントによって活用されます。

source: JDK networking `java.net.SocketAddress`, `java.net.InetAddress`, etc.
ja_jp: JDK ネットワーキング `java.net.SocketAddress`、 `java.net.InetAddress` など

source: JFR can be preconfigured to dump a file, and when the application exits, JFR will output the file. The file will contain the content of the JFR event stream to which Quarkus custom events have also been added. You can, of course, get this file at any time you want, even if your application exits unexpectedly.
ja_jp: JFR はファイルをダンプするように事前設定することができ、アプリケーションが終了すると JFR はファイルを出力します。 ファイルには、Quarkus カスタムイベントも追加された JFR イベントストリームの内容が含まれます。 このファイルは、アプリケーションが予期せず終了した場合でも、当然ながらいつでも取得可能です。

source: JFR configuration
ja_jp: JFR 設定

source: JKS is an old but still widely used Java-specific format. However, to work with this format, you must use specific, and nowadays also deprecated, Java tooling. Thus, its use with your {project-name} application is not recommended.
ja_jp: JKS は古いフォーマットですが、今でも広く使用されている Java 固有のフォーマットです。 ただし、このフォーマットを扱うには、現在では非推奨となっている特定の Java ツールを使用する必要があります。 したがって、{project-name} アプリケーションでの使用は推奨されません。

source: JKS is becoming less commonly used. Since Java 9, the default keystore format in Java is PKCS12. The most significant difference between JKS and PKCS12 is that JKS is a format specific to Java. In contrast, PKCS12 is a standardized, language-neutral way of storing encrypted private keys and certificates.
ja_jp: JKS は、あまり一般的に使用されなくなっています。Java 9 以降、Java のデフォルトのキーストア形式は PKCS12 です。JKS と PKCS12 の最も大きな違いは、JKS が Java 固有のフォーマットであることです。対照的に、PKCS12 は、暗号化された秘密鍵と証明書を保存するための標準化された言語中立的な方法です。

source: JKS keystores
ja_jp: JKS キーストア

source: JKS keystores are single files that contain the certificate and the private key for the server or client, used to authenticate and establish secure communications in TLS/SSL connections.
ja_jp: JKS キーストアは、サーバーまたはクライアントの証明書と秘密鍵を含む単一のファイルです。TLS/SSL 接続で認証してセキュアな通信を確立するために使用されます。

source: JKS keystores are single files that contain the server or client certificate and its private key, used to authenticate and establish secure TLS/SSL connections.
ja_jp: JKS キーストアは、認証およびセキュアな TLS/SSL 接続の確立に使用される、サーバーまたはクライアントの証明書とその秘密鍵を含む単一のファイルです。

source: JKS truststores
ja_jp: JKS トラストストア

source: JKS truststores are single files that contain multiple certificates. You can use the alias to select the appropriate certificate when multiple certificates are present. However, avoid using the JKS format, because it is less secure than PKCS12.
ja_jp: JKS トラストストアは、複数の証明書を含む単一のファイルです。 複数の証明書が存在する場合は、エイリアスを使用して適切な証明書を選択できます。 ただし、JKS フォーマットは PKCS12 よりもセキュリティーが低いため、使用しないでください。

source: JMC is essentially a GUI for JFR. Some Java distributions include JMC, but if not, you need to download it manually.
ja_jp: JMC は基本的に JFR の GUI です。 一部の Java ディストリビューションには JMC が含まれていますが、含まれていない場合は、手動でダウンロードする必要があります。

source: JMX can be enabled by setting JVM system properties:
ja_jp: JMXは、JVMのシステムプロパティを設定することで有効にすることができます。

source: JNDI disabled by default
ja_jp: JNDIはデフォルトで無効化されました

source: JPA batches changes you make to your entities and sends changes (it is called flush) at the end of the transaction or before a query. This is usually a good thing as it is more efficient. But if you want to check optimistic locking failures, do object validation right away or generally want to get immediate feedback, you can force the flush operation by calling `entity.flush()` or even use `entity.persistAndFlush()` to make it a single method call. This will allow you to catch any `PersistenceException` that could occur when JPA send those changes to the database. Remember, this is less efficient so don't abuse it. And your transaction still has to be committed.
ja_jp: JPAはエンティティに加えた変更をバッチ処理し、トランザクションの最後やクエリーの前に変更を送信します（フラッシュと呼びます）。これは効率的であるため、通常は良いことです。しかし、楽観ロックの失敗をチェックしたり、オブジェクトの検証をすぐに行ったり、一般的にはすぐにフィードバックを得たい場合には、 `entity.flush()` を呼び出して強制的にフラッシュ操作を行うか、あるいは `entity.persistAndFlush()` を使用して単一のメソッド呼び出しの中で行うことができます。これによりJPAが変更をデータベースに送信する際に発生する可能性のある `PersistenceException` をキャッチすることができます。ただし、これはあまり効率が良くないので悪用しないでください。また、トランザクションはまだコミットされていないはずです。

source: JPA batches changes you make to your entities and sends changes (it's called flush) at the end of the transaction or before a query. This is usually a good thing as it's more efficient. But if you want to check optimistic locking failures, do object validation right away or generally want to get immediate feedback, you can force the flush operation by calling `entity.flush()` or even use `entity.persistAndFlush()` to make it a single method call. This will allow you to catch any `PersistenceException` that could occur when JPA send those changes to the database. Remember, this is less efficient so don't abuse it. And your transaction still has to be committed.
ja_jp: JPAはエンティティに加えた変更をバッチ処理し、トランザクションの最後やクエリの前に変更を送信します（フラッシュと呼びます）。これは効率的であるため、通常は良いことです。しかし、楽観ロックの失敗をチェックしたり、オブジェクトの検証をすぐに行ったり、一般的にはすぐにフィードバックを得たい場合には、 `entity.flush()` を呼び出して強制的にフラッシュ操作を行うか、あるいは `entity.persistAndFlush()` を使用して単一のメソッド呼び出しの中で行うことができます。これによりJPAが変更をデータベースに送信する際に発生する可能性のある `PersistenceException` をキャッチすることができます。ただし、これはあまり効率が良くないので悪用しないでください。また、トランザクションはまだコミットされていないはずです。

source: JReleaser adds executable wrappers around your JAR for your application to be easily executable.
ja_jp: JReleaser は、アプリケーションを簡単に実行できるように、JAR に実行可能なラッパーを追加します。

source: JReleaser will perform the following tasks for us:
ja_jp: JReleaserが以下の作業を代行します。

source: JSON Binding
ja_jp: JSON バインディング

source: JSON Binding support
ja_jp: JSON バインディング サポート

source: JSON Example
ja_jp: JSON の例

source: JSON Hypertext Application Language (HAL) support
ja_jp: JSON ハイパーテキストアプリケーション言語 (HAL) のサポート

source: JSON Logging Format
ja_jp: JSON ログフォーマット

source: JSON Object and JSON Array are both supported as Quarkus HTTP endpoint requests and response bodies (using classic RESTEasy and Quarkus REST). Consider these endpoints:
ja_jp: JSON Object と JSON Array は、Quarkus の HTTP エンドポイントリクエストとレスポンスボディーとしてサポートされています (従来の RESTEasy と Quarkus REST を使用)。 これらのエンドポイントについて考えてみましょう。

source: JSON Object and JSON Array are both supported as Quarkus HTTP endpoint requests and response bodies (using classic RESTEasy and RESTEasy Reactive). Consider these endpoints:
ja_jp: JSON ObjectとJSON Arrayは、QuarkusのHTTPエンドポイントのリクエストとレスポンスボディとしてサポートされています（従来のRESTEasyとRESTEasy Reactiveを使用）。これらのエンドポイントについて考えてみましょう。

source: JSON Processing support
ja_jp: JSON Processing サポート

source: JSON Schema Serialization
ja_jp: JSON スキーマシリアライゼーション

source: JSON Serializer/deserializer generation
ja_jp: JSON シリアライザー/デシリアライザーの生成

source: JSON Web Key (JWK) Base64 URL encoded
ja_jp: JSON Web Key (JWK) Base64 URL エンコード

source: JSON Web Key Set (JWKS) Base64 URL encoded
ja_jp: JSON Web Key Set (JWKS) Base64 URL エンコード

source: JSON Web Key Set (JWKS) path
ja_jp: JSON Web Key Set (JWKS) パス

source: JSON Web Token (JWT) is defined by the RFC 7519 specification as a compact, URL-safe means of representing claims.
ja_jp: JSON Web Token (JWT) は、クレームを表すコンパクトで URL セーフな手段として RFC 7519 仕様で定義されています。

source: JSON Web Token (JWT) is defined by the link:https://datatracker.ietf.org/doc/html/rfc7519[RFC 7519] specification as a compact, URL-safe means of representing claims. These claims are encoded as a JSON object and can be used as the payload of a JSON Web Signature (JWS) structure or the plaintext of a JSON Web Encryption (JWE) structure. This mechanism enables claims to be digitally signed or protected for integrity with a Message Authentication Code (MAC) and encrypted.
ja_jp: JSON Web Token (JWT) は、link:https://datatracker.ietf.org/doc/html/rfc7519[RFC 7519] 仕様で定義されており、コンパクトで URL セーフな形式でクレームを表現する手段です。 クレームは JSON オブジェクトとしてエンコードされ、JSON Web Signature (JWS) 構造のペイロードとして使用することも、JSON Web Encryption (JWE) 構造の平文として使用することもできます。 この仕組みにより、クレームはデジタル署名されるか、メッセージ認証コード (MAC) によって整合性が保護され、さらに暗号化することが可能になります。

source: JSON Web Token Claim Verification
ja_jp: JSON Web トークンのクレーム検証

source: JSON Web Token claim verification
ja_jp: JSON Web トークンのクレーム検証

source: JSON and XML serialization/deserialization in Hibernate ORM can be customized by implementing a `org.hibernate.type.format.FormatMapper` and annotating the implementation with the appropriate qualifiers:
ja_jp: Hibernate ORM における JSON および XML のシリアル化/デシリアル化は、 `org.hibernate.type.format.FormatMapper` を実装し 適切な修飾子を使用して実装にアノテーションを付けることでカスタマイズできます。

source: JSON as the Default Content Type
ja_jp: デフォルトのコンテンツタイプとしての JSON

source: JSON is now the _lingua franca_ between microservices.
ja_jp: JSON は今やマイクロサービス間の _共通言語_ となっています。

source: JSON is now the lingua franca between microservices.
ja_jp: JSONは今やマイクロサービス間の共通言語です。

source: JSON is now the lingua franca between microservices. In this guide, we see how you can get your REST services to consume and produce JSON payloads.
ja_jp: JSON は現在、マイクロサービス間の共通言語となっています。このガイドでは、REST サービスが JSON ペイロードを消費して生成する方法を見ていきます。

source: JSON is now the lingua franca between microservices. See how you can get your REST services to consume and produce JSON payloads.
ja_jp: JSON は今やマイクロサービス間の共通語となっています。RESTサービスでJSONペイロードを消費したり生成したりする方法をご紹介します。

source: JSON logging format
ja_jp: JSONロギングフォーマット

source: JSON mapping and validation
ja_jp: JSONのマッピングとバリデーション

source: JSON representation of `Quote` objects will be used in messages sent to the AMQP queues and also in the server-sent events sent to browser clients.
ja_jp: `Quote` オブジェクトの JSON 表現は、AMQP キューに送信されるメッセージ、およびブラウザークライアントに送信されるサーバー送信イベントで使用されます。

source: JSON representation of `Quote` objects will be used in messages sent to the Kafka topic and also in the server-sent events sent to web browsers.
ja_jp: `Quote` オブジェクトの JSON 表現は、Kafka トピックに送信されるメッセージ、および Web ブラウザーに送信されるサーバー送信イベントで使用されます。

source: JSON representation of `Quote` objects will be used in messages sent to the Pulsar topic and also in the server-sent events sent to web browsers.
ja_jp: `Quote` オブジェクトの JSON 表現は、Pulsar トピックに送信されるメッセージ、および Web ブラウザーに送信されるサーバー送信イベントで使用されます。

source: JSON representation of `Quote` objects will be used in messages sent to the RabbitMQ queues and also in the server-sent events sent to browser clients.
ja_jp: `Quote` オブジェクトのJSON表現は、RabbitMQキューに送信されるメッセージや、ブラウザクライアントに送信されるserver-sent eventで使用されます。

source: JSON serialisation
ja_jp: JSON シリアライゼーション

source: JSON serialization
ja_jp: JSON シリアライゼーション

source: JSON serialization libraries use Java reflection to get the properties of an object and serialize them.
ja_jp: JSON シリアライズライブラリーは、 Java のリフレクションを使用してオブジェクトのプロパティーを取得してシリアライズします。

source: JSON value types
ja_jp: JSON 値のタイプ

source: JSON viewers, code editors, or metrics charts
ja_jp: JSON ビューアー、コードエディター、またはメトリクスチャート

source: JSON web token claim verification
ja_jp: JSON Web トークンのクレーム検証

source: JSON-B serialization support for RESTEasy
ja_jp: RESTEasy 向けの JSON-B シリアライゼーションサポート

source: JSON‑RPC usage
ja_jp: JSON‑RPC の使用

source: JTA transaction support (included in Hibernate ORM)
ja_jp: JTA トランザクションサポート (Hibernate ORM に含まれる)

source: JUnit 5 https://junit.org/junit5/docs/current/user-guide/#writing-tests-nested[@Nested tests] may help to structure more complex test scenarios. However, only basic use cases are tested with `@QuarkusComponentTest`.
ja_jp: JUnit 5 link:https://junit.org/junit5/docs/current/user-guide/#writing-tests-nested[@Nested テスト] は、より複雑なテストシナリオを構成するのに役立つかもしれません。 しかし、 `@QuarkusComponentTest` を使ってテストできるのは基本的なユースケースだけです。

source: JUnit 6 and Testcontainers 2
ja_jp: JUnit 6とTestcontainers 2

source: JUnit https://docs.junit.org/current/user-guide/#writing-tests-nested[@Nested tests] are useful for structuring more complex test scenarios. However, note that it is not possible to assign different test profiles or resources to nested tests within the same parent class.
ja_jp: JUnit の https://docs.junit.org/current/user-guide/#writing-tests-nested[@Nested テスト] は、より複雑なテストシナリオを構成するのに役立ちます。ただし、同じ親クラス内のネストされたテストに異なるテストプロファイルやリソースを割り当てることはできないことに注意してください。

source: JUnit https://docs.junit.org/current/user-guide/#writing-tests-nested[@Nested tests] may help to structure more complex test scenarios. However, only basic use cases are tested with `@QuarkusComponentTest`.
ja_jp: JUnit https://docs.junit.org/current/user-guide/#writing-tests-nested[@Nested テスト] は、より複雑なテストシナリオを構成するのに役立つかもしれません。しかし、`@QuarkusComponentTest` でテストされるのは基本的なユースケースのみです。

source: JVM Debugging
ja_jp: JVM デバッグ

source: JVM container image
ja_jp: JVM コンテナイメージ

source: JVM execution of an application includes runtime optimization of the code that profits from profile information built up during execution. That includes the opportunities to inline a lot more of the code, locate hot code on direct paths (i.e. ensure better instruction cache locality) and cut out a lot of the code on cold paths (on the JVM a lot of code does not get compiled until something tries to execute it -- it is replaced with a trap that causes deoptimization and recompilation). Removal of cold paths provides many more optimization opportunities than are available for ahead of time compilation because it significantly reduces the branch complexity and combinatorial logic of the smaller amount of hot code that is compiled.
ja_jp: JVMによるアプリケーションの実行には、実行中に蓄積されるプロファイル情報を利用したコードの実行時最適化が含まれます。これには、より多くのコードをインライン化したり、ホットコードをダイレクトパスに配置したり（つまり、より良い命令キャッシュのローカリティを確保する）、コールドパスにある多くのコードをカットしたりする機会が含まれます（JVMでは、多くのコードが何かが実行しようとするまでコンパイルされず、最適化解除や再コンパイルを引き起こすトラップに置き換えられます）。コールドパスを取り除くことで、コンパイルされる少量のホットコードの分岐の複雑さや組み合わせロジックが大幅に削減されるため、先行してコンパイルする場合よりも多くの最適化の機会が得られます。

source: JVM mode
ja_jp: JVMモード

source: JVM mode vs Native mode
ja_jp: JVM モードとネイティブモード

source: JWE encryption is used to encrypt the session cookie, using the `A256GCMKW` algorithm to wrap the generated content encryption key by default. You can try to use the JWE `dir` encryption with `quarkus.oidc.token-state-manager.encryption-algorithm=dir` which can produce shorter JWE sequences as the encryption and decryption is done with the same session cookie encryption key directly, avoiding the need to generate and wrap a content encryption key.
ja_jp: セッション Cookie の暗号化には JWE 暗号化が使用され、デフォルトでは `A256GCMKW` アルゴリズムを使用して、生成されたコンテンツ暗号化キーをラップします。`quarkus.oidc.token-state-manager.encryption-algorithm=dir` を使用して JWE `dir` 暗号化を試すこともできます。これにより、同じセッション Cookie 暗号化キーで直接暗号化と復号が行われるため、コンテンツ暗号化キーの生成とラップが不要になり、より短い JWE シーケンスを生成できる可能性があります。

source: JWK cache refresh interval in minutes. It is ignored unless the `mp.jwt.verify.publickey.location` points to the HTTP or HTTPS URL-based JWK set and no HTTP `Cache-Control` response header with a positive `max-age` parameter value is returned from a JWK HTTPS endpoint.
ja_jp: JWK キャッシュの更新間隔 (分単位)。 `mp.jwt.verify.publickey.location` が HTTP または HTTPS URL ベースの JWK セットを指し、正の `max-age` パラメーター値を持つ HTTP `Cache-Control` レスポンスヘッダーが JWK HTTPS エンドポイントから返されない限り無視されます。

source: JWK cache refresh interval in minutes. It will be ignored unless the `mp.jwt.verify.publickey.location` points to the HTTP or HTTPS URL based JWK set and no HTTP `Cache-Control` response header with a positive `max-age` parameter value is returned from a JWK HTTPS endpoint.
ja_jp: JWK キャッシュの更新間隔 (分単位)。 `mp.jwt.verify.publickey.location` が HTTP または HTTPS URL ベースの JWK セットを指し、正の `max-age` パラメーター値を持つ HTTP `Cache-Control` レスポンスヘッダーが JWK HTTPS エンドポイントから返されない限り無視されます。

source: JWK cache size
ja_jp: JWK キャッシュサイズ

source: JWK cache time to live
ja_jp: JWK キャッシュの有効期間

source: JWK clean-up timer interval
ja_jp: JWK クリーンアップタイマーの間隔

source: JWK refresh interval
ja_jp: JWK 更新間隔

source: JWT Bearer
ja_jp: JWT ベアラー

source: JWT as a cookie support
ja_jp: Cookie としての JWT のサポート

source: JWT authentication headers and claims
ja_jp: JWT 認証ヘッダーとクレーム

source: JWT client credentials
ja_jp: JWT クライアントクレデンシャル

source: JWT client_secret_jwt method properties
ja_jp: JWT client_secret_jwt 方式のプロパティー

source: JWT header and claim properties
ja_jp: JWT ヘッダーおよびクレームプロパティー

source: JWT https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[client_secret_jwt client authentication option] requires creating a JWT token signed with a symmetric key also known to the OIDC provider.
ja_jp: JWT https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[client_secret_jwt クライアント認証オプション] では、OIDC プロバイダーにも既知の対称鍵で署名された JWT トークンを作成する必要があります。

source: JWT https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[private_key_jwt client authentication option] requires creating a JWT token signed with the client private key, with the client public key registered in the OIDC provider.
ja_jp: JWT https://openid.net/specs/openid-connect-core-1_0.html#ClientAuthentication[private_key_jwt クライアント認証オプション] では、クライアントの秘密鍵で署名された JWT トークンを作成し、クライアントの公開鍵を OIDC プロバイダーに登録しておく必要があります。

source: JWT private_key_jwt method properties
ja_jp: JWT private_key_jwt 方式のプロパティー

source: JWT source properties
ja_jp: JWT ソースプロパティー

source: JWT token certificate chain
ja_jp: JWT トークン証明書チェーン

source: JWT tokens are significantly longer than opaque tokens. Nonetheless, the providers effectively delegate most of the token-associated state to the client by storing it as the token claims and either signing or encrypting them.
ja_jp: JWT トークンは不透明トークンよりも大幅に長くなります。 その場合もプロバイダーは、トークンクレームとしてトークン関連の状態を保存し、それに署名するか暗号化することで、トークン関連の状態の大部分をクライアントに効果的に委譲します。
